MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS804/mcu.h
#define _SPI1IMSK2_RXMSK5_POSITION               0x0000000D
#define _SPI1IMSK2_RXMSK5_MASK                   0x00002000
#define _SPI1IMSK2_RXMSK5_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK_POSITION                0x00000000
#define _SPI1IMSKH_TXMSK_MASK                    0x0000003F
#define _SPI1IMSKH_TXMSK_LENGTH                  0x00000006

#define _SPI1IMSKH_TXWIEN_POSITION               0x00000007
#define _SPI1IMSKH_TXWIEN_MASK                   0x00000080
#define _SPI1IMSKH_TXWIEN_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK_POSITION                0x00000008
#define _SPI1IMSKH_RXMSK_MASK                    0x00003F00
#define _SPI1IMSKH_RXMSK_LENGTH                  0x00000006

#define _SPI1IMSKH_RXWIEN_POSITION               0x0000000F
#define _SPI1IMSKH_RXWIEN_MASK                   0x00008000
#define _SPI1IMSKH_RXWIEN_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK0_POSITION               0x00000000
#define _SPI1IMSKH_TXMSK0_MASK                   0x00000001
#define _SPI1IMSKH_TXMSK0_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK1_POSITION               0x00000001
#define _SPI1IMSKH_TXMSK1_MASK                   0x00000002
#define _SPI1IMSKH_TXMSK1_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK2_POSITION               0x00000002
#define _SPI1IMSKH_TXMSK2_MASK                   0x00000004
#define _SPI1IMSKH_TXMSK2_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK3_POSITION               0x00000003
#define _SPI1IMSKH_TXMSK3_MASK                   0x00000008
#define _SPI1IMSKH_TXMSK3_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK4_POSITION               0x00000004
#define _SPI1IMSKH_TXMSK4_MASK                   0x00000010
#define _SPI1IMSKH_TXMSK4_LENGTH                 0x00000001

#define _SPI1IMSKH_TXMSK5_POSITION               0x00000005
#define _SPI1IMSKH_TXMSK5_MASK                   0x00000020
#define _SPI1IMSKH_TXMSK5_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK0_POSITION               0x00000008
#define _SPI1IMSKH_RXMSK0_MASK                   0x00000100
#define _SPI1IMSKH_RXMSK0_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK1_POSITION               0x00000009
#define _SPI1IMSKH_RXMSK1_MASK                   0x00000200
#define _SPI1IMSKH_RXMSK1_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK2_POSITION               0x0000000A
#define _SPI1IMSKH_RXMSK2_MASK                   0x00000400
#define _SPI1IMSKH_RXMSK2_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK3_POSITION               0x0000000B
#define _SPI1IMSKH_RXMSK3_MASK                   0x00000800
#define _SPI1IMSKH_RXMSK3_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK4_POSITION               0x0000000C
#define _SPI1IMSKH_RXMSK4_MASK                   0x00001000
#define _SPI1IMSKH_RXMSK4_LENGTH                 0x00000001

#define _SPI1IMSKH_RXMSK5_POSITION               0x0000000D
#define _SPI1IMSKH_RXMSK5_MASK                   0x00002000
#define _SPI1IMSKH_RXMSK5_LENGTH                 0x00000001

#define _SPI1URDTL_SPI1URDTL_POSITION            0x00000000
#define _SPI1URDTL_SPI1URDTL_MASK                0x0000FFFF
#define _SPI1URDTL_SPI1URDTL_LENGTH              0x00000010

#define _SPI1URDTL_URDATA_POSITION               0x00000000
#define _SPI1URDTL_URDATA_MASK                   0x0000FFFF
#define _SPI1URDTL_URDATA_LENGTH                 0x00000010

#define _SPI1URDTH_SPI1URDTH_POSITION            0x00000000
#define _SPI1URDTH_SPI1URDTH_MASK                0x0000FFFF
#define _SPI1URDTH_SPI1URDTH_LENGTH              0x00000010

#define _SPI1URDTH_URDATA_POSITION               0x00000000
#define _SPI1URDTH_URDATA_MASK                   0x0000FFFF
#define _SPI1URDTH_URDATA_LENGTH                 0x00000010

#define _SPI2CON1_ENHBUF_POSITION                0x00000000
#define _SPI2CON1_ENHBUF_MASK                    0x00000001
#define _SPI2CON1_ENHBUF_LENGTH                  0x00000001

#define _SPI2CON1_SPIFE_POSITION                 0x00000001
#define _SPI2CON1_SPIFE_MASK                     0x00000002
#define _SPI2CON1_SPIFE_LENGTH                   0x00000001

#define _SPI2CON1_MCLKEN_POSITION                0x00000002
#define _SPI2CON1_MCLKEN_MASK                    0x00000004
#define _SPI2CON1_MCLKEN_LENGTH                  0x00000001

#define _SPI2CON1_DISSCK_POSITION                0x00000003
#define _SPI2CON1_DISSCK_MASK                    0x00000008
#define _SPI2CON1_DISSCK_LENGTH                  0x00000001

#define _SPI2CON1_DISSDI_POSITION                0x00000004
#define _SPI2CON1_DISSDI_MASK                    0x00000010
#define _SPI2CON1_DISSDI_LENGTH                  0x00000001

#define _SPI2CON1_MSTEN_POSITION                 0x00000005
#define _SPI2CON1_MSTEN_MASK                     0x00000020
#define _SPI2CON1_MSTEN_LENGTH                   0x00000001

#define _SPI2CON1_CKP_POSITION                   0x00000006
#define _SPI2CON1_CKP_MASK                       0x00000040
#define _SPI2CON1_CKP_LENGTH                     0x00000001

#define _SPI2CON1_SSEN_POSITION                  0x00000007
#define _SPI2CON1_SSEN_MASK                      0x00000080
#define _SPI2CON1_SSEN_LENGTH                    0x00000001

#define _SPI2CON1_CKE_POSITION                   0x00000008
#define _SPI2CON1_CKE_MASK                       0x00000100
#define _SPI2CON1_CKE_LENGTH                     0x00000001

#define _SPI2CON1_SMP_POSITION                   0x00000009
#define _SPI2CON1_SMP_MASK                       0x00000200
#define _SPI2CON1_SMP_LENGTH                     0x00000001

#define _SPI2CON1_MODE16_POSITION                0x0000000A
#define _SPI2CON1_MODE16_MASK                    0x00000400
#define _SPI2CON1_MODE16_LENGTH                  0x00000001

#define _SPI2CON1_MODE32_POSITION                0x0000000B
#define _SPI2CON1_MODE32_MASK                    0x00000800
#define _SPI2CON1_MODE32_LENGTH                  0x00000001

#define _SPI2CON1_DISSDO_POSITION                0x0000000C
#define _SPI2CON1_DISSDO_MASK                    0x00001000
#define _SPI2CON1_DISSDO_LENGTH                  0x00000001

