MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS804/mcu.h
#define _IFS2_C1IF_POSITION                      0x00000003
#define _IFS2_C1IF_MASK                          0x00000008
#define _IFS2_C1IF_LENGTH                        0x00000001

#define _IFS2_DMA3IF_POSITION                    0x00000004
#define _IFS2_DMA3IF_MASK                        0x00000010
#define _IFS2_DMA3IF_LENGTH                      0x00000001

#define _IFS2_IC3IF_POSITION                     0x00000005
#define _IFS2_IC3IF_MASK                         0x00000020
#define _IFS2_IC3IF_LENGTH                       0x00000001

#define _IFS2_IC4IF_POSITION                     0x00000006
#define _IFS2_IC4IF_MASK                         0x00000040
#define _IFS2_IC4IF_LENGTH                       0x00000001

#define _IFS3_SI2C2IF_POSITION                   0x00000001
#define _IFS3_SI2C2IF_MASK                       0x00000002
#define _IFS3_SI2C2IF_LENGTH                     0x00000001

#define _IFS3_MI2C2IF_POSITION                   0x00000002
#define _IFS3_MI2C2IF_MASK                       0x00000004
#define _IFS3_MI2C2IF_LENGTH                     0x00000001

#define _IFS3_INT4IF_POSITION                    0x00000006
#define _IFS3_INT4IF_MASK                        0x00000040
#define _IFS3_INT4IF_LENGTH                      0x00000001

#define _IFS3_C2RXIF_POSITION                    0x00000007
#define _IFS3_C2RXIF_MASK                        0x00000080
#define _IFS3_C2RXIF_LENGTH                      0x00000001

#define _IFS3_C2IF_POSITION                      0x00000008
#define _IFS3_C2IF_MASK                          0x00000100
#define _IFS3_C2IF_LENGTH                        0x00000001

#define _IFS3_PSEMIF_POSITION                    0x00000009
#define _IFS3_PSEMIF_MASK                        0x00000200
#define _IFS3_PSEMIF_LENGTH                      0x00000001

#define _IFS4_U1EIF_POSITION                     0x00000001
#define _IFS4_U1EIF_MASK                         0x00000002
#define _IFS4_U1EIF_LENGTH                       0x00000001

#define _IFS4_U2EIF_POSITION                     0x00000002
#define _IFS4_U2EIF_MASK                         0x00000004
#define _IFS4_U2EIF_LENGTH                       0x00000001

#define _IFS4_C1TXIF_POSITION                    0x00000006
#define _IFS4_C1TXIF_MASK                        0x00000040
#define _IFS4_C1TXIF_LENGTH                      0x00000001

#define _IFS4_C2TXIF_POSITION                    0x00000007
#define _IFS4_C2TXIF_MASK                        0x00000080
#define _IFS4_C2TXIF_LENGTH                      0x00000001

#define _IFS4_PSESIF_POSITION                    0x00000009
#define _IFS4_PSESIF_MASK                        0x00000200
#define _IFS4_PSESIF_LENGTH                      0x00000001

#define _IFS5_SPI3TXIF_POSITION                  0x0000000A
#define _IFS5_SPI3TXIF_MASK                      0x00000400
#define _IFS5_SPI3TXIF_LENGTH                    0x00000001

#define _IFS5_SPI3RXIF_POSITION                  0x0000000B
#define _IFS5_SPI3RXIF_MASK                      0x00000800
#define _IFS5_SPI3RXIF_LENGTH                    0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000E
#define _IFS5_PWM1IF_MASK                        0x00004000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000F
#define _IFS5_PWM2IF_MASK                        0x00008000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS6_PWM3IF_POSITION                    0x00000000
#define _IFS6_PWM3IF_MASK                        0x00000001
#define _IFS6_PWM3IF_LENGTH                      0x00000001

#define _IFS6_PWM4IF_POSITION                    0x00000001
#define _IFS6_PWM4IF_MASK                        0x00000002
#define _IFS6_PWM4IF_LENGTH                      0x00000001

#define _IFS6_PWM5IF_POSITION                    0x00000002
#define _IFS6_PWM5IF_MASK                        0x00000004
#define _IFS6_PWM5IF_LENGTH                      0x00000001

#define _IFS6_PWM6IF_POSITION                    0x00000003
#define _IFS6_PWM6IF_MASK                        0x00000008
#define _IFS6_PWM6IF_LENGTH                      0x00000001

#define _IFS6_PWM7IF_POSITION                    0x00000004
#define _IFS6_PWM7IF_MASK                        0x00000010
#define _IFS6_PWM7IF_LENGTH                      0x00000001

#define _IFS6_PWM8IF_POSITION                    0x00000005
#define _IFS6_PWM8IF_MASK                        0x00000020
#define _IFS6_PWM8IF_LENGTH                      0x00000001

#define _IFS6_AC2IF_POSITION                     0x00000007
#define _IFS6_AC2IF_MASK                         0x00000080
#define _IFS6_AC2IF_LENGTH                       0x00000001

#define _IFS6_AC3IF_POSITION                     0x00000008
#define _IFS6_AC3IF_MASK                         0x00000100
#define _IFS6_AC3IF_LENGTH                       0x00000001

#define _IFS6_AC4IF_POSITION                     0x00000009
#define _IFS6_AC4IF_MASK                         0x00000200
#define _IFS6_AC4IF_LENGTH                       0x00000001

#define _IFS6_ADCAN0IF_POSITION                  0x0000000E
#define _IFS6_ADCAN0IF_MASK                      0x00004000
#define _IFS6_ADCAN0IF_LENGTH                    0x00000001

#define _IFS6_ADCAN1IF_POSITION                  0x0000000F
#define _IFS6_ADCAN1IF_MASK                      0x00008000
#define _IFS6_ADCAN1IF_LENGTH                    0x00000001

#define _IFS7_ADCAN2IF_POSITION                  0x00000000
#define _IFS7_ADCAN2IF_MASK                      0x00000001
#define _IFS7_ADCAN2IF_LENGTH                    0x00000001

#define _IFS7_ADCAN3IF_POSITION                  0x00000001
#define _IFS7_ADCAN3IF_MASK                      0x00000002
#define _IFS7_ADCAN3IF_LENGTH                    0x00000001

#define _IFS7_ADCAN4IF_POSITION                  0x00000002
#define _IFS7_ADCAN4IF_MASK                      0x00000004
#define _IFS7_ADCAN4IF_LENGTH                    0x00000001

#define _IFS7_ADCAN6IF_POSITION                  0x00000004
#define _IFS7_ADCAN6IF_MASK                      0x00000010
#define _IFS7_ADCAN6IF_LENGTH                    0x00000001

#define _IFS7_ADCAN7IF_POSITION                  0x00000005
#define _IFS7_ADCAN7IF_MASK                      0x00000020
#define _IFS7_ADCAN7IF_LENGTH                    0x00000001

#define _IFS7_SPI1EIF_POSITION                   0x0000000C
#define _IFS7_SPI1EIF_MASK                       0x00001000
#define _IFS7_SPI1EIF_LENGTH                     0x00000001

#define _IFS7_SPI2EIF_POSITION                   0x0000000D
#define _IFS7_SPI2EIF_MASK                       0x00002000
#define _IFS7_SPI2EIF_LENGTH                     0x00000001

#define _IFS7_SPI3EIF_POSITION                   0x0000000E
#define _IFS7_SPI3EIF_MASK                       0x00004000
#define _IFS7_SPI3EIF_LENGTH                     0x00000001

#define _IFS8_CLC1IF_POSITION                    0x0000000A
#define _IFS8_CLC1IF_MASK                        0x00000400
#define _IFS8_CLC1IF_LENGTH                      0x00000001

#define _IFS8_CLC2IF_POSITION                    0x0000000B
#define _IFS8_CLC2IF_MASK                        0x00000800
#define _IFS8_CLC2IF_LENGTH                      0x00000001

#define _IFS8_CLC3IF_POSITION                    0x0000000C
#define _IFS8_CLC3IF_MASK                        0x00001000
#define _IFS8_CLC3IF_LENGTH                      0x00000001

